{
    "convertedBy": "TensorFlow.js Converter v4.21.0",
    "format": "layers-model",
    "generatedBy": "keras v3.4.1",
    "modelTopology": {
        "backend": "tensorflow",
        "keras_version": "3.4.1",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "build_input_shape": [
                    null,
                    1
                ],
                "dtype": {
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "module": "keras",
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                1
                            ],
                            "dtype": "float32",
                            "name": "input_layer",
                            "sparse": false
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "linear",
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "module": "keras.initializers",
                                "registered_name": null
                            },
                            "bias_regularizer": null,
                            "dtype": {
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "module": "keras",
                                "registered_name": null
                            },
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "module": "keras.initializers",
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "name": "dense",
                            "trainable": true,
                            "units": 3,
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "linear",
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "module": "keras.initializers",
                                "registered_name": null
                            },
                            "bias_regularizer": null,
                            "dtype": {
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "module": "keras",
                                "registered_name": null
                            },
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "module": "keras.initializers",
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "name": "dense_1",
                            "trainable": true,
                            "units": 3,
                            "use_bias": true
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "activation": "linear",
                            "bias_constraint": null,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "module": "keras.initializers",
                                "registered_name": null
                            },
                            "bias_regularizer": null,
                            "dtype": {
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "module": "keras",
                                "registered_name": null
                            },
                            "kernel_constraint": null,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "module": "keras.initializers",
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "name": "dense_2",
                            "trainable": true,
                            "units": 2,
                            "use_bias": true
                        }
                    }
                ],
                "name": "sequential",
                "trainable": true
            }
        },
        "training_config": {
            "jit_compile": false,
            "loss": "mean_squared_error",
            "loss_weights": null,
            "metrics": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "amsgrad": false,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "clipnorm": null,
                    "clipvalue": null,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "epsilon": 1e-7,
                    "global_clipnorm": null,
                    "gradient_accumulation_steps": null,
                    "learning_rate": 0.0010000000474974513,
                    "loss_scale_factor": null,
                    "name": "adam",
                    "use_ema": false,
                    "weight_decay": null
                }
            },
            "run_eagerly": false,
            "steps_per_execution": 1,
            "weighted_metrics": null
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "dtype": "float32",
                    "name": "sequential/dense/kernel",
                    "shape": [
                        1,
                        3
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "sequential/dense/bias",
                    "shape": [
                        3
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "sequential/dense_1/kernel",
                    "shape": [
                        3,
                        3
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "sequential/dense_1/bias",
                    "shape": [
                        3
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "sequential/dense_2/kernel",
                    "shape": [
                        3,
                        2
                    ]
                },
                {
                    "dtype": "float32",
                    "name": "sequential/dense_2/bias",
                    "shape": [
                        2
                    ]
                }
            ]
        }
    ]
}